app/controllers/board_controller.rb

  def index
    @data_text = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @data_show = Post.find(params[:board_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create

    @titleResult = params[:inputTitle]
    @editorResult = params[:inputEditor]
    @contentResult = params[:inputContent]

    data = Post.new
    data.title = @titleResult
    data.editor = @editorResult
    data.content = @contentResult
    data.save
---
INSERT INTO "posts" ("title", "editor", "content", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dffds"], ["editor", "fdsadf"], ["content", "fdsafdsa"], ["image", "chelsea.png"], ["created_at", "2017-05-26 05:34:01.717284"], ["updated_at", "2017-05-26 05:34:01.717284"]]

  def delete

    des_board = Post.find(params[:board_id])
    des_board.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]