app/controllers/comment_controller.rb

    def reply_create

        new_reply = Reply.new
        new_reply.dbEditor = params[:inputEditor]
        new_reply.dbContent = params[:inputReply]
        new_reply.post_id = params[:reply_id]
        new_reply.save
---
INSERT INTO "replies" ("dbEditor", "dbContent", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["dbEditor", "dsfbkj"], ["dbContent", "jkhsdjkhf"], ["post_id", 1], ["created_at", "2017-05-28 09:39:37.526039"], ["updated_at", "2017-05-28 09:39:37.526039"]]

    def reply_delete

        del_comment = Reply.find(params[:reply_id])
        del_comment.destroy
---
SELECT  "replies".* FROM "replies" WHERE "replies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "replies" WHERE "replies"."id" = ?  [["id", 1]]